import 'package:project/data/classcar.dart';

class DataCar{
  static List<InfoCar> Car = [
    InfoCar(
      id_car: '1',
      image: 'assets/images_car/Car1.jpg',
      title: 'Volvo C40 2022 ราคา 2.79 ลบ.',
      component: [
        'Volvo C40 การขับขี่ผ่านมอเตอร์ไฟไฟ 4 ล้อ แบบ Dual Motor AWD กำลังศุงสุด 408 แรงม้า ที่ 4350-13900 รอบ/นาที สามารถทำอัตราเร่งจาก 0-100 ได้ใน 4.7 วินาที ระยะทางขับขี่ 500 กิโลเมตรต่อการชาร์จเต็ม 1 ครั้ง',
      ],
      infoCar: [
        'ยี่ห่อ-รุ่น Volvo C40 RECHARGE PURE ELECTRIC 2022 ราคา 2790000',
        'ประเภท Electric - EV (ในสไตล์ ครอสโอเวอร์ คูเป้)',
        'ระบบขับเคลื่อน ขับเคลื่อนสี่ล้อ',
        'เชื้อเพลิงที่ใช้ ไฟฟ้า',
        'ระบบเกียร์ เกียร์ออโต้',
        'วัสดุเบาะ เป็นเบาะหนังแท้ มีระบบไฟฟ้าปรับเบาะ',
        'ระบบเบรค มี(พร้อมระบบกระจายเบรค EBD ระบบเบรคฉุกเฉิน EBA)',
      ],
    ),
    InfoCar(
      id_car: '2',
      image: 'assets/images_car/car2.jpg',
      title: 'Volvo S60 2023 ราคา 2.64 ลบ',
      component: [
        'Volvo S60 S60 Recharge Ultimate T8 Plug-in Hybrid Dark  ไฟหน้าแบบ LED รูปทรง T-shape Full-LEDActive High Beam Illumination Active Bending Light ปรับตามบุคลิกของแต่ละคน ซึ่งระบบจะตั้งค่าเครื่องยนต์เกียร์อัตโนมัติ พวงมาลัย บรก ระบบควบคุมการทรงตัว และงก์ชั่นการเปิด/ปิดเครื่องยนต์ โหมดเหล่านี้ได้แก่Comfort, Dynamic และ Eco รวมทั้งโหมด Individual มาพร้อมระบบ กล้อง 360 , Park Assist Pilot ระบบเสียงจาก Harman Kardon Premium Sound ไปยังลำโพง 14 ตัวผ่านช่องกระจายเสียง 12 ช่อง ระบบปรับระดับเสียงอัตโนมัติหรือ Automatic Level  Adjustment และอัลกอริทีมพิเศษจะปรับระดับเสียงที่ส่งออกมาเพื่อชดเชยและกลบเสียงรบกวนจากภายนอก รองรับ Apple CarPlay ให้คุณเชื่อมต่อกับ iPhone นอกจากนี้ยังรองรับ Android Autoและจะมีการตกแต่งด้วย Driftwoodรุ่u Inscription ระยะทางวิ่งสูงสุดด้วยมอเตอร์ไฟฟ้า Pure mode 90.2* (NEDC)',
      ],
      infoCar: [
        'ยี่ห่อ-รุ่น Volvo S60 Recharge Ultimate T8 Plug-in Hybrid Dark 2023 ราคา 2640000 บาท',
        'ประเภท รถเก๋ง 4 ประตู ,รถไฮบริด',
        'ระบบขับเคลื่อน ขับเคลื่อนสี่ล้อ เครื่องยบต์ 1969 cc, 460 แรงม้า',
        'เชื้อเพลิงที่ใช้ เบนซิน 95,โซฮอลล์ 95',
        'ระบบเกียร์ เกียร์ออโต้ 8T',
        'วัสดุเบาะ เป็นเบาะหนังแท้ มีระบบไฟฟ้าปรับเบาะ',
        'ระบบเบรค มี(พร้อมระบบกระจายเบรค EBD ระบบเบรคฉุกเฉิน EBA)',
      ],
    ),
    InfoCar(
      id_car: '3',
      image: 'assets/images_car/car3.jpg',
      title: 'Volvo S90 2023 ราคา 3.29 ลบ',
      component: [
        'Volvo S90 Recharge Ultimate T8 Plug-in Hybrid Bright ผสานการทำงานของเครื่องยนต์ Drive E เบนซิน 2ลิตร 4 สูบ พร้อมเทอร์โบชาร์จ และมอเตอร์ไฟฟ้า ให้กำลังสูงสุด 317 แรงม้า ที่ 6,000 รอบ/นาที แรงบิด 400 นิวตันเมตร ที่ความเร็วรอบ 3,000-5,400 ต่อนาที พร้อมมอเตอร์ไฟฟ้า 143 แรงม้า แรงบิดสูงสุดจากมอเตอร์ไฟฟ้าที่ 309 นิวตันเมตร และเมื่อรวมกับกำลังเครื่องยนต์เบนซินกับมอเตอร์ไฟฟ้า จึงได้เครื่องยนต์ที่มีพละกำลังแรงถึง 460 แรงม้า',
      ],
      infoCar: [
        'ยี่ห่อ-รุ่น Volvo S90 Recharge Ultimate T8 Plug-in Hybrid Bright 2023 ราคา 3290000 บาท',
        'ประเภท รถเก๋ง 4 ประตู ,รถไฮบริด',
        'ระบบขับเคลื่อน ขับเครื่องสี่ล้อ เครื่องยบต์ 1969 cc, 317 แรงม้า',
        'เชื้อเพลิงที่ใช้ เบนซิน 95,โซฮอลล์ 95',
        'ระบบเกียร์ เกียร์ออโต้ 8AT',
        'วัสดุเบาะ เป็นเบาะหนังแท้ มีระบบไฟฟ้าปรับเบาะ',
        'ระบบเบรค มี(พร้อมระบบกระจายเบรค EBD ระบบเบรคฉุกเฉิน EBA)',
      ],
    ),
    InfoCar(
      id_car: '4',
      image: 'assets/images_car/car4.jpg',
      title: 'Volvo V60 2023 ราคา 2.79 ลบ',
      component: [
        'Volvo V60 Recharge Plus T8 Plug-in Hybrid Bright ไฟหน้าแบบ LED รูปทรง T-shape Full-LED ActiveHigh Beam Illumination Active Bending Light ปรับตามบุคลิกของแต่ละคน ซึ่งระบบจะตั้งค่าเครื่องยนต์ เกียร์อัตโนมัติ พวงมาลัย เบรก ระบบควบคุมการทรงตัว และฟังก์ชั่นการเปิด/ปิดเครื่องยนต์ โหมดเหล่านี้ได้แก่ Comfort,Dynamic และ Eco รวมทั้งโหมด Individual มาพร้อมระบบ กล้อง 360 , Park Assist Pilot ระบบเสียงจาก HighPerformance Sound  สำโพง 11 ตัว ระบบปรับระดับเสียงอัตโนมัติหรือ Automatic Level Adjustment และอัลกอริทีมพิเศษจะปรับระดับเสียงที่ส่งออกมาเพื่อซดเชยและกลบเสียงรบกวนจากภายนอก รองรับ Apple CarPlay ให้คุณเชื่อมต่อกับ iPhone นอกจากนี้ยังรองรับ Android Auto รวมถึงสามารถทำระยะทางวิ่งสูงสุดด้วยมอเตอร์ไฟฟ้า',
      ],
      infoCar: [
        'ยี่ห่อ-รุ่น Volvo V60 Recharge Plus T8 Plug-in Hybrid Bright 2023 ราคา 2790000 บาท',
        'ประเภท รถเก๋งแวน ,รถไฮบริด',
        'ระบบขับเคลื่อน ขับเคลี่อนสี่ล้อ เครื่องยบต์ 1969 cc, 400 แรงม้า',
        'เชื้อเพลิงที่ใช้ เบนซิน 95,โซฮอลล์ 95',
        'ระบบเกียร์ เกียร์ออโต้ 8AT',
        'วัสดุเบาะ เป็นเบาะหนังแท้ มีระบบไฟฟ้าปรับเบาะ',
        'ระบบเบรค มี(พร้อมระบบกระจายเบรค EBD ระบบเบรคฉุกเฉิน EBA)',
      ],
    ),
    InfoCar(
      id_car: '5',
      image: 'assets/images_car/car5.jpg',
      title: 'Volvo XC40 2023 ราคา 2.49 ลบ',
      component: [
        'Volvo XC40 Recharge Ultimate T5 Plug-in Hybrid Bright เครื่องยนต์ 3 สูบ เทอร์โบ 1.5 ลิตร 180 แรงม้าแรงบิด 265นิวตันเมตร เกียร์ 7 สปีด Dual-Clutch Automatic with Geartronic ผสานมอเตอร์ไฟฟ้า 82 แรงม้าแรงบิด 160 นิวตันเมตร กำลังรวมทั้งระบบ 262 แรงม้า แรงบิด 425 นิตันเมตร อัตราสิ้นเปลือง 43.5 กม./ลิตรแบตเตอรี่ Lithium-ion 10.7 kWh ขับขี่ด้วยพลังงานไฟฟ้า (EV Mode) ได้ระยะทาง 52 กม. พร้อมระบบช่วยขับขี่กึ่งอัตโนมัติ ระบบกรองอากาศขั้นสูง Clean Zone เครื่องเสียงระบบ Air Woofer, แท่นชาร์จโทรศัพท์มือถือแบบไร้สาย',
      ],
      infoCar: [
        'ยี่ห่อ-รุ่น Volvo XC40 Recharge Ultimate T5 Plug-in Hybrid Bright 2023 ราคา 2490000 บาท',
        'ประเภท รถอเนกประสงค์ SUV ,รถไฮบริด',
        'ระบบขับเครื่่อง ขับเคลื่อนล้อหน้า เครื่องยบต์ 1477 cc, 265 แรงม้า',
        'เชื้อเพลิงที่ใช้ เบนซิน 95,โซฮอลล์ 95',
        'ระบบเกียร์ เกียร์ออโต้ 7AT',
        'วัสดุเบาะ เป็นเบาะหนังแท้ มีระบบไฟฟ้าปรับเบาะ',
        'ระบบเบรค มี(พร้อมระบบกระจายเบรค EBD ระบบเบรคฉุกเฉิน EBA)',
      ],
    ),
    InfoCar(
      id_car: '6',
      image: 'assets/images_car/car6.jpg',
      title: 'Volvo XC60 2023 ราคา 3.59 ลบ',
      component: [
        'Volvo XC60 Recharge Ultimate T8 Plug-in Hybrid Bright เพิ่มระบบกรองอากาศขั้นสูง Aning (AAC) ที่มีเซ็นเซอร์ตรวจจับพร้อมวันค่าฝุ่นละออง PM2.5 แท่นชาร์จโทรศัพท์มือถือแบบไร้สายเครื่เบนซิน 1,969 ซีซี ขุมพลัง 317 แรงม้าที่ 6,000 รอบต่อนาที กับมอเตอร์ไฟฟ้าอีก 143 แรงม้า เมื่อรวมทั้งระบบจะเป็น460 แรงม้า แรงบิด 709 นิวตันเมตร ขับเคลื่อนแบบ AlI Wheel Drive โดยเครื่องยนต์จะขับเคลื่อนล้อหน้า ส่วนล้อลังจะขับเคลื่อนด้วยมอเตอร์ เกียร์อัตโนมัติ 8 สปีดพร้อมเกียร์ทรอนิค (Geattronic)',
      ],
      infoCar: [
        'ยี่ห่อ-รุ่น Volvo XC60 Recharge Ultimate T8 Plug-in Hybrid Bright 2023 ราคา 3590000 บาท',
        'ประเภท รถอเนกประสงค์ SUV ,รถไฮบริด',
        'ระบบขับเครื่่อง ขับเคลื่อนสี่ล้อ เครื่องยบต์ 1969 cc, 317 แรงม้า',
        'เชื้อเพลิงที่ใช้ เบนซิน 95,โซฮอลล์ 95',
        'ระบบเกียร์ เกียร์ออโต้ 8AT',
        'วัสดุเบาะ เป็นเบาะหนังแท้ มีระบบไฟฟ้าปรับเบาะ',
        'ระบบเบรค มี(พร้อมระบบกระจายเบรค EBD ระบบเบรคฉุกเฉิน EBA)',
      ],
    ),
    InfoCar(
      id_car: '7',
      image: 'assets/images_car/car7.jpg',
      title: 'Volvo XC90 2023 ราคา 4.69 ลบ',
      component: [
        'Volvo XC90  Recharge Ultimate T8 Plug-in Hybrid Bright ขุมพลัง TB Twin Engine Drive E wuBu 2ลิตร 4 สูบ เทอร์โบชาร์จ และมอเตอร์ไฟฟ้า อัพเกรดด้วยระบบทำกรองอากาศขั้นสูง Advanced Air Cleaning (AAC)พร้อมเซ็นเซอร์ตรวจจับและวัดค่าฝุ่นละออง PM25, ระบบเสียงระดับโลกจาก Bowers &Wilkins Premnium, แท่นชาร์จโทรศัพท์มือถือแบบไร้สาย',
      ],
      infoCar: [
        'ยี่ห่อ-รุ่น Volvo XC90 Recharge Ultimate T8 Plug-in Hybrid Bright 2023 ราคา 4690000 บาท',
        'ประเภท รถอเนกประสงค์ SUV ,รถไฮบริด',
        'ระบบขับเครื่่อง ขับเคลื่อนสี่ล้อ เครื่องยบต์ 1969 cc, 317 แรงม้า',
        'เชื้อเพลิงที่ใช้ เบนซิน 95,โซฮอลล์ 95',
        'ระบบเกียร์ เกียร์ออโต้ 8AT',
        'วัสดุเบาะ เป็นเบาะหนังแท้ มีระบบไฟฟ้าปรับเบาะ',
        'ระบบเบรค มี(พร้อมระบบกระจายเบรค EBD ระบบเบรคฉุกเฉิน EBA)',
      ],
    ),
  ];
}